#\*************************/#
#\*******Te3K@_PaynE*******/#
#\**79811131773@yandex.ru**/#
#\*************************/#

'''
Написать программу, которая проверяет, является ли билет счастливым.
Счастливый билет - это тот билет, у которого имеется шестизначный номер,
с условием, что сумма первых трёх чисел равна сумме последних трёх чисел.
'''

# Функция вывода автора программы
def author():
    print('****************************')
    print('Программа создана:')
    print('Илья "Te3K@_PaynE" Новичихин')
    print('79811131773@yandex.ru')
    print('****************************')
